---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.ISingleServerService
source: html/c852e351-51f0-2ca1-9d5a-ef89acf18d4f.htm
---
# ISingleServerService Methods

Implement this method to execute the given server.